zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_cortex.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_cortex.h
  * @author  MCD Application Team
  * @brief   Header file of CORTEX HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP2xx_HAL_CORTEX_H
#define __STM32MP2xx_HAL_CORTEX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"


/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup CORTEX
  * @{
  */
/* Exported types ------------------------------------------------------------*/
/** @defgroup CORTEX_Exported_Types Cortex Exported Types
  * @{
  */

#if (__MPU_PRESENT == 1)
/** @defgroup CORTEX_MPU_Region_Initialization_Structure_definition MPU Region Initialization Structure Definition
  * @brief  MPU Region initialization structure
  * @{
  */
/* [MPU/TYPES] M0+ (ARMv6-M) specific definitions */
#ifdef CORE_CM0PLUS
typedef struct
{
  uint8_t                Enable;                /*!< Specifies the status of the region.
                                                     This parameter can be a value of @ref CORTEX_MPU_Region_Enable   */
  uint8_t                Number;                /*!< Specifies the number of the region to protect.
                                                     This parameter can be a value of @ref CORTEX_MPU_Region_Number   */
  uint32_t               BaseAddress;           /*!< Specifies the base address of the region to protect.             */
  uint8_t                Size;                  /*!< Specifies the size of the region to protect.
                                                     This parameter can be a value of @ref CORTEX_MPU_Region_Size     */
  uint8_t                SubRegionDisable;      /*!< Specifies the number of the subregion protection to disable.
                                                     This parameter must be a number between Min_Data = 0x00 and
                                                     Max_Data = 0xFF                                                  */
  uint8_t                TypeExtField;          /*!< Specifies the TEX field level.
                                                     This parameter can be a value of @ref CORTEX_MPU_TEX_Levels      */
  uint8_t                AccessPermission;      /*!< Specifies the region access permission type.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Region_Permission_Attributes                     */
  uint8_t                DisableExec;           /*!< Specifies the instruction access status.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Instruction_Access                               */
  uint8_t                IsShareable;           /*!< Specifies the shareability status of the protected region.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Access_Shareable                                 */
  uint8_t                IsCacheable;           /*!< Specifies the cacheable status of the region protected.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Access_Cacheable                                 */
  uint8_t                IsBufferable;          /*!< Specifies the bufferable status of the protected region.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Access_Bufferable                                */
} MPU_Region_InitTypeDef;
#endif /* CORE_CM0PLUS */
/* [MPU/TYPES] M33 (ARMv8-M) specific definitions */
#ifdef CORE_CM33
typedef struct
{
  uint8_t                Enable;                /*!< Specifies the status of the region.
                                                     This parameter can be a value of @ref CORTEX_MPU_Region_Enable   */
  uint8_t                Number;                /*!< Specifies the number of the region to protect.
                                                     This parameter can be a value of @ref CORTEX_MPU_Region_Number   */
  uint32_t               BaseAddress;           /*!< Specifies the base address of the region to protect.             */
  uint32_t               LimitAddress;          /*!< Specifies the limit address of the region to protect.            */
  uint8_t                AttributesIndex;       /*!< Specifies the memory attributes index.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Attributes_Number                                */
  uint8_t                AccessPermission;      /*!< Specifies the region access permission type.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Region_Permission_Attributes                     */
  uint8_t                DisableExec;           /*!< Specifies the instruction access status.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Instruction_Access                               */
  uint8_t                IsShareable;           /*!< Specifies the shareability status of the protected region.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Access_Shareable                                 */
} MPU_Region_InitTypeDef;
/**
  * @}
  */
/** @defgroup CORTEX_MPU_Attributes_Initialization_Structure_definition Memory Attributes Structure Definition
  * @{
  */
typedef struct
{
  uint8_t                Number;                /*!< Specifies the index of the memory attributes to be configured.
                                                     This parameter can be a value of
                                                     @ref CORTEX_MPU_Attributes_Number                                */

  uint8_t                Attributes;            /*!< Specifies the memory attributes value.
                                                     This parameter must be a value between Min_Data = 0x0
                                                     and Max_Data = 0xFF                                              */

} MPU_Attributes_InitTypeDef;
/**
  * @}
  */
#endif /* CORE_CM33 */
#endif /* __MPU_PRESENT */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

