zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_cortex.h
/** @defgroup HAL_CORTEX_Aliased_Defines HAL CORTEX Aliased Defines maintained for legacy purpose
  * @{
  */
#define __HAL_CORTEX_SYSTICKCLK_CONFIG HAL_SYSTICK_CLKSourceConfig
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup CORTEX_Exported_Functions CORTEX Exported Functions
  * @{
  */

/** @defgroup CORTEX_Exported_Functions_Group1 Initialization and Configuration functions
  * @brief    Initialization and Configuration functions
  * @{
  */
/* Initialization and Configuration functions *****************************/
/* [NVIC/FUNCTIONS] M0+ (ARMv6-M) / M33 (ARMv8-M) common prototypes */
void HAL_NVIC_SetPriority(IRQn_Type IRQn, uint32_t PreemptPriority, uint32_t SubPriority);
void HAL_NVIC_EnableIRQ(IRQn_Type IRQn);
void HAL_NVIC_DisableIRQ(IRQn_Type IRQn);
void HAL_NVIC_SystemReset(void);
uint32_t HAL_SYSTICK_Config(uint32_t TicksNumb);

/* [NVIC/FUNCTIONS] M33 (ARMv8-M) specific prototypes */
#ifdef CORE_CM33
void HAL_NVIC_SetPriorityGrouping(uint32_t PriorityGrouping);
#endif /* CORE_CM33 */

/**
  * @}
  */

/** @defgroup CORTEX_Exported_Functions_Group2 Peripheral Control functions
  * @brief   Cortex control functions
  * @{
  */
/* Peripheral Control functions ***********************************************/
/* [NVIC/FUNCTIONS] M0+ (ARMv6-M) / M33 (ARMv8-M) common prototypes */
void HAL_NVIC_GetPriority(IRQn_Type IRQn, uint32_t PriorityGroup, uint32_t *const pPreemptPriority,
                          uint32_t *const pSubPriority);
uint32_t HAL_NVIC_GetPendingIRQ(IRQn_Type IRQn);
void HAL_NVIC_SetPendingIRQ(IRQn_Type IRQn);
void HAL_NVIC_ClearPendingIRQ(IRQn_Type IRQn);
void HAL_SYSTICK_CLKSourceConfig(uint32_t CLKSource);
uint32_t HAL_SYSTICK_GetCLKSourceConfig(void);
void HAL_SYSTICK_IRQHandler(void);
void HAL_SYSTICK_Callback(void);

/* [NVIC/FUNCTIONS] M33 (ARMv8-M) specific prototypes */
#ifdef CORE_CM33
uint32_t HAL_NVIC_GetPriorityGrouping(void);
uint32_t HAL_NVIC_GetActive(IRQn_Type IRQn);
/* [NVIC/FUNCTIONS] M33 (ARMv8-M) specific to Security Extension prototypes */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
void HAL_NVIC_ConfigInterruptSecurity(IRQn_Type IRQn, uint32_t IRQSecurityState);
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
#endif /* CORE_CM33 */

#if (__MPU_PRESENT == 1U)
/* [MPU/FUNCTIONS] M0+ (ARMv6-M) / M33 (ARMv8-M) common prototypes */
void HAL_MPU_Enable(uint32_t MPU_Control);
void HAL_MPU_Disable(void);
void HAL_MPU_EnableRegion(uint32_t RegionNumber);
void HAL_MPU_DisableRegion(uint32_t RegionNumber);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* MPU_NS Control functions ***********************************************/
void HAL_MPU_Enable_NS(uint32_t MPU_Control);
void HAL_MPU_Disable_NS(void);
void HAL_MPU_EnableRegion_NS(uint32_t RegionNumber);
void HAL_MPU_DisableRegion_NS(uint32_t RegionNumber);
void HAL_MPU_ConfigRegion_NS(const MPU_Region_InitTypeDef *const pMPU_RegionInit);
void HAL_MPU_ConfigMemoryAttributes_NS(const MPU_Attributes_InitTypeDef *const pMPU_AttributesInit);
#endif /* __ARM_FEATURE_CMSE */

/* [MPU/FUNCTIONS] M0+ (ARMv6-M) specific prototypes */
#ifdef CORE_CM0PLUS
void HAL_MPU_ConfigRegion(const MPU_Region_InitTypeDef *MPU_Init);
#endif /* CORE_CM0PLUS */

/* [MPU/FUNCTIONS] M33 (ARMv8-M) specific prototypes */
#ifdef CORE_CM33
void HAL_MPU_ConfigRegion(const MPU_Region_InitTypeDef *const pMPU_RegionInit);
void HAL_MPU_ConfigMemoryAttributes(const MPU_Attributes_InitTypeDef *const pMPU_AttributesInit);
#endif /* CORE_CM33 */
#endif /* __MPU_PRESENT */

/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup CORTEX_Private_Macros CORTEX Private Macros
  * @{
  */

/* [NVIC/MACROS] M0+ (ARMv6-M) / M33 (ARMv8-M) common definitions */
#define IS_NVIC_DEVICE_IRQ(IRQ)                (((uint32_t)(IRQ) >= 0x00U) && ((uint32_t)(IRQ) < (uint32_t)MAX_IRQ_n))

/* [NVIC/MACROS] M33 (ARMv8-M) specific definitions */
#ifdef CORE_CM33

#define IS_NVIC_PREEMPTION_PRIORITY(__PRIO__, __PRIOGRP__)   (((__PRIO__) < (1uL << __NVIC_PRIO_BITS)) && \
                                                              ((__PRIO__) < (0x1uL << (0x07u -(uint8_t)(__PRIOGRP__)))))
/* WARNING ! Historical macro name IS_NVIC_PRIORITY_GROUP is confusing       */
/*           according to ARM specifications, because IS_NVIC_PRIORITY_GROUP */
/*           seems to stand for checking "Group Priority number of bits"     */
/*           whereas it checks "Priority Grouping" value in respect to       */
/*           number of priority levels (aka "__NVIC_PRIO_BITS").             */
/* As a consequence, it LIMITS lowest value for "Priority Grouping"          */
/* according to __NVIC_PRIO_BITS = 4 to value "NVIC_PRIORITYGROUP_4".        */
#define IS_NVIC_PRIORITY_GROUP(GROUP) (((GROUP) == NVIC_PRIORITYGROUP_0) || \
                                       ((GROUP) == NVIC_PRIORITYGROUP_1) || \
                                       ((GROUP) == NVIC_PRIORITYGROUP_2) || \
                                       ((GROUP) == NVIC_PRIORITYGROUP_3) || \
                                       ((GROUP) == NVIC_PRIORITYGROUP_4))

/* However, whatever the number of priority levels, all "Priority Grouping" */
/* values in range [0;7] (used to set PRIO field of register AIRCR) are     */
/* managed internally to saturate "Group Priority number of bits" value.    */
/* That is why we can define new macro IS_NVIC_PRIORITY_GROUPING() to check */
/* "Priority Grouping" value. */
#define IS_NVIC_PRIORITY_GROUPING(GROUP) (((GROUP) < 8U) && ((GROUP) >=0U))

#define IS_NVIC_SUB_PRIORITY(__PRIO__, __PRIOGRP__)   (((__PRIOGRP__) < (0x07u - ((uint8_t)__NVIC_PRIO_BITS))) ?\
                                                       ((__PRIO__) < (1u)): \
                                                       ((__PRIO__) < (0x1uL << ((__PRIOGRP__) - \
                                                                                (0x07u -((uint8_t)__NVIC_PRIO_BITS))))))

#define IS_NVIC_IRQN_TYPE(IRQn_Type_value) (((IRQn_Type_value) >= MemoryManagement_IRQn) && \
                                            ((IRQn_Type_value) < MAX_IRQ_n))

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define IS_NVIC_IRQ_SECURITY_STATE(IRQ_Security_State_value) ((IRQ_Security_State_value == NVIC_SECURE_INTERRUPT) || \
                                                              (IRQ_Security_State_value == NVIC_NONSECURE_INTERRUPT))
#define IS_MPU_INSTANCE(INSTANCE) (((INSTANCE) == MPU) || ((INSTANCE) == MPU_NS))
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
#endif /* CORE_CM33 */

#define IS_SYSTICK_CLK_SOURCE(SOURCE) (((SOURCE) == SYSTICK_CLKSOURCE_HCLK)|| \
                                       ((SOURCE) == SYSTICK_CLKSOURCE_HCLK_DIV8))

/* [NVIC/MACROS] M0+ (ARMv6-M) specific definitions */
#ifdef CORE_CM0PLUS
#define IS_NVIC_PREEMPTION_PRIORITY(PRIORITY)  ((PRIORITY) < (1UL << __NVIC_PRIO_BITS))
#define IS_NVIC_SUB_PRIORITY(PRIORITY)         (PRIORITY == 0)

#define IS_NVIC_IRQN_TYPE(IRQn_Type_value) ((IRQn_Type_value >= SVC_IRQn) && \
                                            (IRQn_Type_value < MAX_IRQ_n))
#endif /* CORE_CM0PLUS */

#if (__MPU_PRESENT == 1)
/* [MPU/MACROS] M0+ (ARMv6-M) / M33 (ARMv8-M) common definitions */
#define IS_MPU_HFNMI_PRIVDEF_CONTROL(CONTROL) (((CONTROL) == MPU_HFNMI_PRIVDEF_NONE) || \
                                               ((CONTROL) == MPU_HARDFAULT_NMI)      || \
                                               ((CONTROL) == MPU_PRIVILEGED_DEFAULT) || \
                                               ((CONTROL) == MPU_HFNMI_PRIVDEF))

#define IS_MPU_REGION_ENABLE(STATE) (((STATE) == MPU_REGION_ENABLE) || \
                                     ((STATE) == MPU_REGION_DISABLE))

#define IS_MPU_INSTRUCTION_ACCESS(STATE) (((STATE) == MPU_INSTRUCTION_ACCESS_ENABLE) || \
                                          ((STATE) == MPU_INSTRUCTION_ACCESS_DISABLE))

/* [MPU/MACROS] M0+ (ARMv6-M) specific definitions */
#ifdef CORE_CM0PLUS
#define IS_MPU_REGION_NUMBER(NUMBER)    (((NUMBER) == MPU_REGION_NUMBER0) || \
                                         ((NUMBER) == MPU_REGION_NUMBER1) || \
                                         ((NUMBER) == MPU_REGION_NUMBER2) || \
                                         ((NUMBER) == MPU_REGION_NUMBER3) || \
                                         ((NUMBER) == MPU_REGION_NUMBER4) || \
                                         ((NUMBER) == MPU_REGION_NUMBER5) || \
                                         ((NUMBER) == MPU_REGION_NUMBER6) || \
                                         ((NUMBER) == MPU_REGION_NUMBER7))

